tutorials/elastic_cases/biofilm/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

//specificy wetting phase properties
wetting 
{
    transportModel  Newtonian; 
    nu              [0 2 -1 0 0 0 0] 1e-6; //viscocity
    rho             [1 -3 0 0 0 0 0] 1000; //density
}

//specify non-wetting properties
nonWetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5; 
    rho             [1 -3 0 0 0 0 0] 1;
}
  
//Solid Phase Parameters
activateSolidMechanics 1; //do we want to include solid mechanics?  

//Two Phase Parameters
activateCapillarity            0; //do we want to include capillarity?
alphaSmoothingCoeff            0.5; //How much we wan to smooth alpha_w
activatePorousContactAngle     0; //do we want to activate the contact angle at the porous interface?
theta0                         180; //contact angle at the porous interface

sigma            [1 0 -2 0 0 0 0]  0.077; //surface tension
invFk0           [0 -2 0 0 0 0 0]  0; //2-D simulation correction (if neccesary)

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0; //irriducible saturation
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999; //maximum saturation

relativePermeabilityModel  VanGenuchten; //choose relative permeability model
capillarityModel           VanGenuchten; //choose capillary pressure model

//Specify the model coefficients
VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;  
   m 0.8;
}

//choose if we want to include ddt(porosity) effects on pressure.
pCoeff 0;
// ************************************************************************* //
